Repository: mhdcindioglu/VisaOffice
Catalog: VisaOffice/Localization/Resources.*.resx
Languages: ar, tr

source: Home
ar: الرئيسية
tr: Ana Sayfa

source: About
ar: حولنا
tr: Hakkımızda

source: Contact
ar: اتصل بنا
tr: İletişim

source: Services
ar: الخدمات
tr: Hizmetler

source: Visa Types
ar: أنواع التأشيرات
tr: Vize Türleri

source: Apply
ar: تقديم طلب
tr: Başvuru Yap

# Track
source: Track Application
ar: تتبع الطلب
tr: Başvuru Takibi

# ProfessionalVisaServices
source: Professional Visa Services for Turkey
ar: خدمات التأشيرات المهنية لتركيا
tr: Türkiye için Profesyonel Vize Hizmetleri

# HeroDescription
source: Your trusted partner for all Turkey visa and immigration needs. Fast, reliable, and professional service with expert guidance every step of the way.
ar: شريكك الموثوق لجميع احتياجات التأشيرات والهجرة إلى تركيا. خدمة سريعة وموثوقة ومهنية مع إرشاد الخبراء في كل خطوة.
tr: Tüm Türkiye vize ve göçmenlik ihtiyaçlarınız için güvenilir ortağınız. Her adımda uzman rehberliği ile hızlı, güvenilir ve profesyonel hizmet.

# ApplyForVisa
source: Apply for Turkey Visa
ar: تقديم طلب تأشيرة تركيا
tr: Türkiye Vizesi Başvurusu

source: Track Application
ar: تتبع الطلب
tr: Başvuru Takibi

source: Fast Processing
ar: معالجة سريعة
tr: Hızlı İşlem

# FastProcessingDesc
source: Quick turnaround times with express processing options available for urgent applications.
ar: أوقات تسليم سريعة مع خيارات معالجة عاجلة متاحة للطلبات العاجلة.
tr: Acil başvurular için ekspres işlem seçenekleri ile hızlı sonuç alma süreleri.

source: Expert Guidance
ar: إرشاد الخبراء
tr: Uzman Rehberliği

# ExpertGuidanceDesc
source: Professional consultants with years of experience in Turkey visa regulations.
ar: استشاريون محترفون بخبرة سنوات في لوائح التأشيرات التركية.
tr: Türkiye vize düzenlemelerinde yılların deneyimine sahip profesyonel danışmanlar.

source: Secure Process
ar: عملية آمنة
tr: Güvenli Süreç

# SecureProcessDesc
source: Your documents and personal information are handled with the highest security standards.
ar: يتم التعامل مع مستنداتك ومعلوماتك الشخصية بأعلى معايير الأمان.
tr: Belgeleriniz ve kişisel bilgileriniz en yüksek güvenlik standartları ile işlenir.

# TouristVisa
source: Turkey Tourist Visa
ar: تأشيرة سياحية تركيا
tr: Türkiye Turist Vizesi

# TouristVisaDesc
source: Perfect for leisure travel, sightseeing, and exploring Turkey's rich culture and history.
ar: مثالية للسفر الترفيهي ومشاهدة المعالم واستكشاف الثقافة والتاريخ التركي الغني.
tr: Eğlence seyahatleri, gezi ve Türkiye'nin zengin kültürü ve tarihini keşfetmek için mükemmel.

# BusinessVisa
source: Turkey Business Visa
ar: تأشيرة أعمال تركيا
tr: Türkiye İş Vizesi

# BusinessVisaDesc
source: For business meetings, conferences, trade shows, and commercial activities in Turkey.
ar: لاجتماعات الأعمال والمؤتمرات والمعارض التجارية والأنشطة التجارية في تركيا.
tr: İş toplantıları, konferanslar, ticaret fuarları ve Türkiye'deki ticari faaliyetler için.

# StudentVisa
source: Turkey Student Visa
ar: تأشيرة طلابية تركيا
tr: Türkiye Öğrenci Vizesi

# StudentVisaDesc
source: For students enrolled in Turkish educational institutions for academic purposes.
ar: للطلاب المسجلين في المؤسسات التعليمية التركية لأغراض أكاديمية.
tr: Akademik amaçlarla Türk eğitim kurumlarına kayıtlı öğrenciler için.

# WorkVisa
source: Turkey Work Visa
ar: تأشيرة عمل تركيا
tr: Türkiye Çalışma Vizesi

# WorkVisaDesc
source: For individuals seeking employment or already employed in Turkey.
ar: للأفراد الذين يسعون للعمل أو العاملين بالفعل في تركيا.
tr: Türkiye'de istihdam arayan veya halihazırda çalışan bireyler için.

# TransitVisa
source: Turkey Transit Visa
ar: تأشيرة عبور تركيا
tr: Türkiye Transit Vizesi

# TransitVisaDesc
source: For travelers passing through Turkey to reach their final destination.
ar: للمسافرين الذين يمرون عبر تركيا للوصول إلى وجهتهم النهائية.
tr: Nihai varış noktalarına ulaşmak için Türkiye'den geçiş yapan yolcular için.

# FamilyVisa
source: Turkey Family Reunification Visa
ar: تأشيرة لم الشمل العائلي تركيا
tr: Türkiye Aile Birleşimi Vizesi

# FamilyVisaDesc
source: For visiting family members or relatives residing in Turkey.
ar: لزيارة أفراد العائلة أو الأقارب المقيمين في تركيا.
tr: Türkiye'de ikamet eden aile üyelerini veya akrabalarını ziyaret etmek için.

source: Address
ar: العنوان
tr: Adres

source: Phone
ar: الهاتف
tr: Telefon

source: Email
ar: البريد الإلكتروني
tr: E-posta

source: Working Hours
ar: ساعات العمل
tr: Çalışma Saatleri

# MainOfficeAddress
source: Taksim Square, Beyoğlu, Istanbul 34437
ar: ميدان تقسيم، بيوغلو، اسطنبول 34437
tr: Taksim Meydanı, Beyoğlu, İstanbul 34437

# MainOfficeHours
source: Monday - Friday: 9:00 AM - 6:00 PM, Saturday: 10:00 AM - 2:00 PM
ar: الاثنين - الجمعة: 9:00 صباحاً - 6:00 مساءً، السبت: 10:00 صباحاً - 2:00 مساءً
tr: Pazartesi - Cuma: 09:00 - 18:00, Cumartesi: 10:00 - 14:00

# AnkaraOfficeAddress
source: Kızılay, Çankaya, Ankara 06420
ar: كيزيلاي، تشانكايا، أنقرة 06420

# AnkaraOfficeHours
source: Monday - Friday: 9:00 AM - 5:00 PM
ar: الاثنين - الجمعة: 9:00 صباحاً - 5:00 مساءً
tr: Pazartesi - Cuma: 09:00 - 17:00

# IzmirOfficeAddress
source: Alsancak, Konak, İzmir 35220
ar: ألسانجاك، كوناك، إزمير 35220

# IzmirOfficeHours
source: Monday - Friday: 9:00 AM - 5:00 PM
ar: الاثنين - الجمعة: 9:00 صباحاً - 5:00 مساءً
tr: Pazartesi - Cuma: 09:00 - 17:00

source: Visa Services
ar: خدمات التأشيرات
tr: Vize Hizmetleri

source: Requirements
ar: المتطلبات
tr: Gereksinimler

source: Fees
ar: الرسوم
tr: Ücretler

source: All Services
ar: جميع الخدمات
tr: Tüm Hizmetler

source: Document Translation
ar: ترجمة الوثائق
tr: Belge Çevirisi

source: Legal Consultation
ar: الاستشارة القانونية
tr: Hukuki Danışmanlık

source: Book Appointment
ar: حجز موعد
tr: Randevu Al

source: Offices
ar: المكاتب
tr: Ofisler

source: FAQ
ar: الأسئلة الشائعة
tr: SSS

# CompanyDescription
source: Professional Turkey visa services with expert guidance and fast processing. Your trusted partner for all Turkey visa and immigration needs.
ar: خدمات التأشيرات التركية المهنية مع إرشاد الخبراء ومعالجة سريعة. شريكك الموثوق لجميع احتياجات التأشيرات والهجرة إلى تركيا.
tr: Uzman rehberliği ve hızlı işlem ile profesyonel Türkiye vize hizmetleri. Tüm Türkiye vize ve göçmenlik ihtiyaçlarınız için güvenilir ortağınız.

source: Quick Links
ar: روابط سريعة
tr: Hızlı Bağlantılar

source: Apply Online
ar: تقديم طلب إلكتروني
tr: Online Başvuru

source: Translation
ar: الترجمة
tr: Çeviri

source: Legal Advice
ar: الاستشارة القانونية
tr: Hukuki Danışmanlık

source: Appointments
ar: المواعيد
tr: Randevular

source: Contact Info
ar: معلومات الاتصال
tr: İletişim Bilgileri

source: All rights reserved.
ar: جميع الحقوق محفوظة.
tr: Tüm hakları saklıdır.

source: Privacy Policy
ar: سياسة الخصوصية
tr: Gizlilik Politikası

source: Popular Visa Types
ar: أنواع التأشيرات الشائعة
tr: Popüler Vize Türleri

# ChooseFromWideRange
source: Choose from our wide range of visa services
ar: اختر من مجموعتنا الواسعة من خدمات التأشيرات
tr: Geniş vize hizmet yelpazemizden seçim yapın

source: Apply Now
ar: قدم الآن
tr: Şimdi Başvur

source: View All Visa Types
ar: عرض جميع أنواع التأشيرات
tr: Tüm Vize Türlerini Görüntüle

source: Applications Processed
ar: الطلبات المعالجة
tr: İşlenen Başvuru

source: Success Rate
ar: معدل النجاح
tr: Başarı Oranı

source: Countries Served
ar: البلدان المخدومة
tr: Hizmet Verilen Ülke

source: Support Available
ar: الدعم متاح
tr: Destek Mevcut

# ReadyToStart
source: Ready to start your visa application?
ar: مستعد لبدء طلب التأشيرة؟
tr: Vize başvurunuzu başlatmaya hazır mısınız?

# GetExpertGuidance
source: Get expert guidance and fast processing for your visa needs.
ar: احصل على إرشاد الخبراء ومعالجة سريعة لاحتياجات التأشيرة.
tr: Vize ihtiyaçlarınız için uzman rehberliği ve hızlı işlem alın.

source: Contact Us
ar: اتصل بنا
tr: Bize Ulaşın

source: Get Started
ar: ابدأ الآن
tr: Başlayın

# AboutUsTitle
source: About Turkey Visa Office
ar: حول مكتب التأشيرات التركية
tr: Türkiye Vize Ofisi Hakkında

# AboutDescription
source: We are Turkey's leading visa service provider, helping thousands of travelers obtain their visas quickly and efficiently.
ar: نحن مقدم خدمات التأشيرات الرائد في تركيا، نساعد آلاف المسافرين في الحصول على تأشيراتهم بسرعة وكفاءة.
tr: Türkiye'nin önde gelen vize hizmet sağlayıcısıyız, binlerce gezginin vizelerini hızlı ve verimli bir şekilde almalarına yardımcı oluyoruz.

source: Our Mission
ar: مهمتنا
tr: Misyonumuz

# MissionDescription
source: To provide reliable, fast, and professional visa services while ensuring complete customer satisfaction.
ar: توفير خدمات تأشيرات موثوقة وسريعة ومهنية مع ضمان رضا العملاء الكامل.
tr: Tam müşteri memnuniyetini sağlarken güvenilir, hızlı ve profesyonel vize hizmetleri sunmak.

source: Why Choose Us
ar: لماذا تختارنا
tr: Neden Bizi Seçmelisiniz

source: Experienced Team
ar: فريق ذو خبرة
tr: Deneyimli Ekip

# ExperiencedTeamDesc
source: Our team has extensive experience in Turkey visa regulations and immigration law.
ar: فريقنا يتمتع بخبرة واسعة في لوائح التأشيرات التركية وقانون الهجرة.
tr: Ekibimiz Türkiye vize düzenlemeleri ve göçmenlik hukuku konusunda geniş deneyime sahiptir.

source: Quick Turnaround
ar: تسليم سريع
tr: Hızlı İşlem

# QuickTurnaroundDesc
source: We process applications efficiently to meet your travel deadlines.
ar: نعالج الطلبات بكفاءة لتلبية مواعيد سفرك.
tr: Seyahat son tarihlerinizi karşılamak için başvuruları verimli bir şekilde işliyoruz.

source: Personalized Service
ar: خدمة شخصية
tr: Kişiselleştirilmiş Hizmet

# PersonalizedServiceDesc
source: Each application receives individual attention from our expert consultants.
ar: كل طلب يحصل على اهتمام فردي من استشاريينا الخبراء.
tr: Her başvuru uzman danışmanlarımızdan bireysel ilgi görür.

source: Comprehensive Support
ar: دعم شامل
tr: Kapsamlı Destek

# ComprehensiveSupportDesc
source: From application to approval, we support you every step of the way.
ar: من التقديم حتى الموافقة، ندعمك في كل خطوة على الطريق.
tr: Başvurudan onaya kadar her adımda size destek oluyoruz.

# ContactUsTitle
source: Contact Us
ar: اتصل بنا
tr: Bize Ulaşın

# GetInTouch
source: Get in touch with our expert team
ar: تواصل مع فريق الخبراء لدينا
tr: Uzman ekibimizle iletişime geçin

source: Name
ar: الاسم
tr: Ad

source: Your Name
ar: اسمك
tr: Adınız

source: Your Email
ar: بريدك الإلكتروني
tr: E-posta Adresiniz

source: Subject
ar: الموضوع
tr: Konu

source: Your Subject
ar: موضوعك
tr: Konunuz

source: Message
ar: الرسالة
tr: Mesaj

source: Your Message
ar: رسالتك
tr: Mesajınız

source: Send Message
ar: إرسال الرسالة
tr: Mesaj Gönder

source: Visa Application Form
ar: نموذج طلب التأشيرة
tr: Vize Başvuru Formu

source: Personal Information
ar: المعلومات الشخصية
tr: Kişisel Bilgiler

source: First Name
ar: الاسم الأول
tr: Ad

source: Last Name
ar: اسم العائلة
tr: Soyad

source: Date of Birth
ar: تاريخ الميلاد
tr: Doğum Tarihi

source: Nationality
ar: الجنسية
tr: Uyruk

source: Passport Number
ar: رقم جواز السفر
tr: Pasaport Numarası

source: Visa Type Required
ar: نوع التأشيرة المطلوبة
tr: Gerekli Vize Türü

source: Submit
ar: إرسال
tr: Gönder

# CompleteYourVisaApplication
source: Complete your visa application form below
ar: أكمل نموذج طلب التأشيرة أدناه
tr: Aşağıdaki vize başvuru formunu tamamlayın

source: Phone Number
ar: رقم الهاتف
tr: Telefon Numarası

source: Full Name
ar: الاسم الكامل
tr: Ad Soyad

source: English
ar: الإنجليزية
tr: İngilizce

source: Turkish
ar: التركية
tr: Türkçe

source: Arabic
ar: العربية

# BrandName
source: Visa Office
ar: مكتب التأشيرات
tr: Vize Ofisi

# ProcessingTime_5_10_BusinessDays
source: 5-10 business days
ar: 5-10 أيام عمل
tr: 5-10 iş günü

# ProcessingTime_3_7_BusinessDays
source: 3-7 business days
ar: 3-7 أيام عمل
tr: 3-7 iş günü

# ProcessingTime_10_15_BusinessDays
source: 10-15 business days
ar: 10-15 يوم عمل
tr: 10-15 iş günü

# ProcessingTime_15_20_BusinessDays
source: 15-20 business days
ar: 15-20 يوم عمل
tr: 15-20 iş günü

# ProcessingTime_2_5_BusinessDays
source: 2-5 business days
ar: 2-5 أيام عمل
tr: 2-5 iş günü

# ProcessingTime_7_12_BusinessDays
source: 7-12 business days
ar: 7-12 يوم عمل
tr: 7-12 iş günü

# ContactMessageThankYou
source: Thank you for your message. We will get back to you soon!
ar: شكراً لك على رسالتك. سنتواصل معك قريباً!
tr: Mesajınız için teşekkür ederiz. En kısa sürede size döneceğiz!

# ValidPassport
source: Valid passport (minimum 6 months validity)
ar: جواز سفر صالح (صالح لمدة 6 أشهر على الأقل)
tr: Geçerli pasaport (en az 6 ay geçerlilik)

# PassportPhotos
source: 2 passport photos
ar: صورتان شخصيتان بحجم جواز السفر
tr: 2 adet pasaport fotoğrafı

source: Travel itinerary
ar: برنامج السفر
tr: Seyahat planı

source: Hotel reservation
ar: حجز الفندق
tr: Otel rezervasyonu

# BankStatements
source: Bank statements (last 3 months)
ar: كشوف الحسابات المصرفية (آخر 3 أشهر)
tr: Banka hesap özeti (son 3 ay)

source: Travel insurance
ar: تأمين السفر
tr: Seyahat sigortası

# BusinessInvitationLetter
source: Business invitation letter from Turkish company
ar: خطاب دعوة عمل من شركة تركية
tr: Türk firmasından davet mektubu

source: Company registration documents
ar: وثائق تسجيل الشركة
tr: Şirket kayıt belgeleri

source: Financial statements
ar: البيانات المالية
tr: Mali durum belgeleri

source: Purpose of visit documentation
ar: وثائق الغرض من الزيارة
tr: Ziyaret amacı belgesi

source: Business travel insurance
ar: تأمين السفر للأعمال
tr: İş seyahat sigortası

# AcceptanceLetterFromUniversity
source: Acceptance letter from Turkish university
ar: خطاب قبول من الجامعة التركية
tr: Türk üniversitesinden kabul mektubu

source: Proof of financial support
ar: إثبات الدعم المالي
tr: Mali destek belgesi

source: Academic transcripts and certificates
ar: كشوف الدرجات والشهادات الأكاديمية
tr: Akademik transkript ve diplomalar

source: Medical examination report
ar: تقرير الفحص الطبي
tr: Sağlık raporu

# StudentInsurance
source: Student insurance coverage
ar: تأمين الطلاب
tr: Öğrenci sigortası

# JobOfferLetter
source: Job offer letter from Turkish employer
ar: خطاب عرض العمل من رب العمل التركي
tr: Türk işverenden iş teklifi mektubu

source: Work permit
ar: تصريح العمل
tr: Çalışma izni

source: Educational and professional certificates
ar: الشهادات التعليمية والمهنية
tr: Eğitim ve mesleki sertifikalar

source: Employment contract
ar: عقد العمل
tr: İş sözleşmesi

source: Confirmed onward ticket
ar: تذكرة مؤكدة للوجهة التالية
tr: Onward bilet

source: Transit itinerary
ar: برنامج العبور
tr: Transit planı

# VisaForFinalDestination
source: Visa for final destination (if required)
ar: تأشيرة الوجهة النهائية (إذا كانت مطلوبة)
tr: Varış ülkesi vizesi (gerekirse)

source: Invitation letter from family member
ar: خطاب دعوة من أحد أفراد العائلة
tr: Aile üyesinden davet mektubu

source: Proof of relationship
ar: إثبات القرابة
tr: Akrabalık belgesi

# SponsorDocumentsAndFinancialProof
source: Sponsor's documents and financial proof
ar: وثائق الكفيل والإثبات المالي
tr: Sponsor belgeleri ve mali durum

source: Family photographs
ar: صور عائلية
tr: Aile fotoğrafları

source: Accommodation arrangements
ar: ترتيبات الإقامة
tr: Konaklama düzenlemeleri

# ServiceTurkeyVisaApplication
source: Turkey Visa Application Processing
ar: معالجة طلبات التأشيرة التركية
tr: Türkiye Vize Başvuru İşlemleri

# ServiceTurkeyVisaApplicationDesc
source: Complete visa application processing for all visa types
ar: معالجة كاملة لطلبات التأشيرة لجميع أنواع التأشيرات
tr: Tüm vize türleri için kapsamlı vize başvuru işlemleri

# ServiceDocumentTranslation
source: Document Translation
ar: ترجمة الوثائق
tr: Belge Çevirisi

# ServiceDocumentTranslationDesc
source: Official translation of documents by sworn translators
ar: ترجمة رسمية للوثائق من قبل مترجمين محلفين
tr: Yeminli tercümanlar tarafından resmi belge çevirisi

# ServiceLegalConsultation
source: Legal Consultation
ar: الاستشارة القانونية
tr: Hukuki Danışmanlık

# ServiceLegalConsultationDesc
source: Expert legal advice on immigration and visa matters
ar: مشورة قانونية خبيرة في مسائل الهجرة والتأشيرات
tr: Göçmenlik ve vize konularında uzman hukuki danışmanlık

# ServiceAppointmentScheduling
source: Appointment Scheduling
ar: جدولة المواعيد
tr: Randevu Planlaması

# ServiceAppointmentSchedulingDesc
source: Book appointments for consulate interviews and consultations
ar: حجز مواعيد لمقابلات الق領事والاستشارات
tr: Konsolosluk görüşmeleri ve danışmanlık için randevu alma

# ServiceExpressProcessing
source: Express Processing
ar: معالجة سريعة
tr: Ekspres İşlem

# ServiceExpressProcessingDesc
source: Fast-track visa processing for urgent applications
ar: معالجة سريعة للتأشيرات للطلبات العاجلة
tr: Acil başvurular için hızlandırılmış vize işlemleri

# ServiceDocumentReview
source: Document Review
ar: مراجعة الوثائق
tr: Belge İncelemesi

# ServiceDocumentReviewDesc
source: Comprehensive review of your application documents
ar: مراجعة شاملة لوثائق طلبك
tr: Başvuru belgelerinizin kapsamlı incelemesi

# PriceFrom60
source: From ₺60
ar: من ₺60
tr: 60₺'den başlayan fiyatlarla

# PriceFrom25PerPage
source: From ₺25/page
ar: من ₺25/صفحة
tr: Sayfa başı 25₺'den

# PriceFrom150PerHour
source: From ₺150/hour
ar: من ₺150/ساعة
tr: Saat başı 150₺'den

# PriceFree
source: Free
ar: مجاني
tr: Ücretsiz

# PriceAdditional100
source: Additional ₺100
ar: ₺100 إضافية
tr: Ek 100₺

# PriceFrom40
source: From ₺40
ar: من ₺40
tr: 40₺'den başlayan

# FAQProcessingTimeQuestion
source: How long does Turkey visa processing take?
ar: كم من الوقت تستغرق معالجة التأشيرة التركية؟
tr: Türkiye vizesi işlem süresi ne kadar?

# FAQProcessingTimeAnswer
source: Processing times vary by visa type: Tourist visas take 5-10 business days, Business visas take 3-7 business days, Student visas take 10-15 business days, and Work visas take 15-20 business days.
ar: تختلف أوقات المعالجة حسب نوع التأشيرة: التأشيرات السياحية تستغرق 5-10 أيام عمل، وتأشيرات الأعمال تستغرق 3-7 أيام عمل، والتأشيرات الطلابية تستغرق 10-15 يوم عمل، وتأشيرات العمل تستغرق 15-20 يوم عمل.
tr: İşlem süreleri vize türüne göre değişir: Turist vizesi 5-10 iş günü, İş vizesi 3-7 iş günü, Öğrenci vizesi 10-15 iş günü, Çalışma vizesi 15-20 iş günü sürer.

# FAQTouristRequirementsQuestion
source: What documents do I need for a tourist visa?
ar: ما هي الوثائق التي أحتاجها للحصول على تأشيرة سياحية؟
tr: Turist vizesi için hangi belgeler gerekli?

# FAQTouristRequirementsAnswer
source: You need a valid passport (6+ months validity), 2 passport photos, travel itinerary, hotel bookings, bank statements (last 3 months), and travel insurance.
ar: تحتاج إلى جواز سفر صالح (صالح لأكثر من 6 أشهر)، صورتان شخصيتان، برنامج السفر، حجوزات الفندق، كشوف الحسابات المصرفية (آخر 3 أشهر)، وتأمين السفر.
tr: Geçerli pasaport (6+ ay geçerlilik), 2 pasaport fotoğrafı, seyahat planı, otel rezervasyonu, banka hesap özeti (son 3 ay) ve seyahat sigortası gereklidir.

# FAQTrackingQuestion
source: Can I track my visa application?
ar: هل يمكنني تتبع طلب التأشيرة الخاص بي؟
tr: Vize başvurumu takip edebilir miyim?

# FAQTrackingAnswer
source: Yes, you can track your application using the application ID provided when you submitted your application. Use our online tracking system.
ar: نعم، يمكنك تتبع طلبك باستخدام رقم الطلب المقدم عند تقديم طلبك. استخدم نظام التتبع الإلكتروني لدينا.
tr: Evet, başvuru yaptığınızda verilen başvuru numarası ile online takip sistemimizi kullanabilirsiniz.

# FAQRejectionQuestion
source: What if my visa application is rejected?
ar: ماذا لو تم رفض طلب التأشيرة الخاص بي؟
tr: Vize başvurum reddedilirse ne olur?

# FAQRejectionAnswer
source: If rejected, you'll receive a detailed explanation. You can reapply after addressing the issues mentioned in the rejection letter. Fees may apply for reapplication.
ar: في حالة الرفض، ستتلقى شرحاً مفصلاً. يمكنك إعادة التقديم بعد معالجة القضايا المذكورة في خطاب الرفض. قد تطبق رسوم لإعادة التقديم.
tr: Reddedilme durumunda detaylı açıklama alırsınız. Red mektubunda belirtilen sorunları giderdikten sonra yeniden başvurabilirsiniz. Yeniden başvuru için ücret ödemeniz gerekebilir.

# FAQAppointmentQuestion
source: Do I need an appointment for visa submission?
ar: هل أحتاج إلى موعد لتقديم التأشيرة؟
tr: Vize başvurusu için randevu gerekli mi?

# FAQAppointmentAnswer
source: While walk-ins are accepted, we highly recommend booking an appointment to avoid waiting times and ensure personalized service.
ar: بينما نقبل الزيارات بدون موعد، نوصي بشدة بحجز موعد لتجنب أوقات الانتظار وضمان خدمة شخصية.
tr: Randevusuz da kabul edilmekle birlikte, bekleme sürelerini önlemek ve kişiselleştirilmiş hizmet almak için randevu almanızı önemle tavsiye ederiz.

# FAQPaymentQuestion
source: What payment methods do you accept?
ar: ما هي طرق الدفع التي تقبلونها؟
tr: Hangi ödeme yöntemlerini kabul ediyorsunuz?

# FAQPaymentAnswer
source: We accept cash, credit cards, debit cards, and bank transfers. All fees must be paid before application processing begins.
ar: نقبل النقد وبطاقات الائتمان وبطاقات الخصم والتحويلات المصرفية. يجب دفع جميع الرسوم قبل بدء معالجة الطلب.
tr: Nakit, kredi kartı, banka kartı ve banka havalesi kabul ediyoruz. Tüm ücretler işlem başlamadan önce ödenmelidir.

# FAQAuthorizationQuestion
source: Can someone else submit my application?
ar: هل يمكن لشخص آخر تقديم طلبي؟
tr: Başka biri benim adıma başvuru yapabilir mi?

# FAQAuthorizationAnswer
source: Yes, you can authorize someone to submit on your behalf with a signed authorization letter and copy of your ID.
ar: نعم، يمكنك تفويض شخص آخر لتقديم الطلب نيابة عنك مع خطاب تفويض موقع ونسخة من هويتك.
tr: Evet, imzalı yetki mektubu ve kimlik kartı fotokopyanız ile başka birini yetkilendirebilirsiniz.

# FAQValidityQuestion
source: What is the validity of different visa types?
ar: ما هي صلاحية أنواع التأشيرات المختلفة؟
tr: Farklı vize türlerinin geçerlilik süreleri nedir?

# FAQValidityAnswer
source: Tourist visas are typically valid for 30-90 days, Business visas for 30-180 days, Student visas for the course duration, and Work visas vary by contract.
ar: التأشيرات السياحية عادة صالحة لمدة 30-90 يوماً، وتأشيرات الأعمال لمدة 30-180 يوماً، والتأشيرات الطلابية لمدة الدورة، وتأشيرات العمل تختلف حسب العقد.
tr: Turist vizeleri genellikle 30-90 gün, İş vizeleri 30-180 gün, Öğrenci vizeleri kurs süresi boyunca, Çalışma vizeleri ise sözleşmeye göre değişir.

# CategoryProcessing
source: Processing
ar: المعالجة
tr: İşlem

# CategoryRequirements
source: Requirements
ar: المتطلبات
tr: Gereksinimler

# CategoryTracking
source: Tracking
ar: التتبع
tr: Takip

# CategoryRejection
source: Rejection
ar: الرفض
tr: Red

# CategoryAppointments
source: Appointments
ar: المواعيد
tr: Randevular

# CategoryPayment
source: Payment
ar: الدفع
tr: Ödeme

# CategorySubmission
source: Submission
ar: التقديم
tr: Başvuru

# CategoryValidity
source: Validity
ar: الصلاحية
tr: Geçerlilik

source: Our Professional Services
ar: خدماتنا المهنية
tr: Profesyonel Hizmetlerimiz

# ComprehensiveSolutions
source: Comprehensive solutions for all your visa and immigration needs
ar: حلول شاملة لجميع احتياجات التأشيرات والهجرة
tr: Tüm vize ve göçmenlik ihtiyaçlarınız için kapsamlı çözümler

source: Learn More
ar: اعرف المزيد
tr: Daha Fazla Bilgi

source: Why Choose Our Services?
ar: لماذا تختار خدماتنا؟
tr: Neden Hizmetlerimizi Seçmelisiniz?

# ExcellenceInService
source: We provide excellence in every aspect of our service delivery
ar: نحن نقدم التميز في كل جانب من جوانب تقديم خدماتنا
tr: Hizmet sunumumuzun her alanında mükemmellik sağlıyoruz

source: Expert Team
ar: فريق خبراء
tr: Uzman Ekip

source: Frequently Asked Questions
ar: الأسئلة الشائعة
tr: Sıkça Sorulan Sorular

# FindAnswersToCommonQuestions
source: Find answers to common questions about our visa services
ar: اعثر على إجابات للأسئلة الشائعة حول خدمات التأشيرات لدينا
tr: Vize hizmetlerimizle ilgili yaygın soruların cevaplarını bulun

source: All Questions
ar: جميع الأسئلة
tr: Tüm Sorular
